import 'package:flutter/material.dart';

class PlantDetails extends StatelessWidget {
  static String routeName = 'PlantDetails';

  int index = 0;

  PlantDetails({this.index});

  List<Map> plant_details = [
    {
      'image': 'assets/images/nn.jpeg',
      'title': 'نعناع',
      'details': 'أقطعي عود من النعناع'
          'ضعي التربة في الفخار وأضيفي كمية مناسبة من الماء حتى تصبح التربة رطبة'
          'ضعي نبتة النعناع في التربة'
          'ثم قومي بوضع الفخار في زاوية مشمسة جزئيًا والأفضل أن تكون في المطبخ'
          'حافظي على سقي نبتة النعناع بشكل مستمر وأبعديها عن الأماكن الجافة.'
          'يمكنك زراعة النعناع في زاوية معرضة لأشعة الشمس على أن تسقيها باستمرار.'
          'وعندما تكون تكون السيقان قد أصبحت أطول والأوراق أقصر، يعتبر هذا أفضل وقت لقطف النعناع.'
          'أقطعي الأوراق بنسبة الثلث والنصف من فترة إلى أخرى حتى تنمو الأوراق الجديدة، استخدميها مباشرة أو احتفظي بها في الفريزر.'
    },
    {
      'image': 'assets/images/tt.jpeg',
      'title': 'طماطم',
      'details': 'اختاري نوع البذور المناسب لكِ، هناك نوعان من نبات الطماطم، نوع يصل لطول محدد ثم يبدأ إنتاج الثمار، ونوع آخر ينتج خلال الموسم بكميات قليلة ثم يتوقف في فصل الشتاء، كذلك هناك أنواع مختلفة من البذور لأنواع الطماطم وألوانها، اختاري النوع المفضل لكِ'
          'ازرعي بذور الطماطم في حاوية زرع عمقها 15 سنتيمترًا بها تربة رطبة ولينة، ضعي البذور على عمق ستة ملليمترات من سطح التربة'
          'ضعي الحاوية في مكان دافئ حتى يبدأ الإنبات، يُفضِل البعض وضع الحاوية أعلى الثلاجة'
          'يبدأ النبات الإنبات بعد مدة تتراوح بين خمسة أيام وعشرة أيام'
          'عندما ينبت الزرع، انقلي حاوية الزرع إلى مكان مشمس، تحتاج الطماطم إلى التعرض للشمس يوميًا مدة تتراوح بين ست ساعات وثماني ساعات'
          'يمكنكِ أن تبدئي الزراعة بالشتلات الجاهزة، بدلًا من البداية من مرحلة البذور للتسهيل على نفسك'
          'عندما تبدأ الأزهار الظهور، انقلي النبات إلى وعاء أكبر، وضعيه في مكان درجة حرارته من 24 إلى 29 درجة مئوية، ومعرضًا لضوء الشمس'
          'عند وضع النبات بالقرب من الشباك للتعرض للشمس، اعكسي وضع النبات خلال اليوم، حتى يتعرض النبات من جميع الاتجاهات لضوء الشمس'
          'إذا كان النبات في المنزل ولا يتعرض للرياح، عرضي النبات لهواء المروحة مدة عشر دقائق مرتين يوميًا'
          'اسقي النبات في الأقل مرة أسبوعيًا، وفي المرات شديدة الحرارة مرتين أسبوعيًا أو ثلاث مرات'
          'عندما يصل طول النبات إلى متر، ابدئي إزالة الأوراق من الجزء السفلي من النبات، إذ إن الأوراق في هذا الجزء من النبات معرضة أكثر للإصابة بالأمراض والفطريات، وتستهلك من طاقة النبات وغذائه'
          'لا تزيلي الطماطم إلا بعد نضجها تمامًا'
          'إذا سقطت بعض ثمار الطماطم قبل نضجها، ضعيها في كيس ورقي حتى تنضج'
          'تحتاج الطماطم إلى مدة تتراوح بين أربعين وخمسين يومًا حتى تنضج تمامًا'
    },
    {
      'image': 'assets/images/cucumber.jpg',
      'title': 'خيار',
      'details': 'استخدم نشارة بلاستيكية سوداء أو بنية اللون. نظرًا لأن التربة الدافئة والرطبة ضرورية للإنتاج الأعلى، استخدم نشارة بلاستيكية داكنة على سرير الخيار.'
          'سيؤدي ذلك إلى تسريع النمو وزيادة الغلات من خلال الحفاظ على رطوبة التربة والحفاظ على درجة حرارة عالية للتربة. كما سيبقي النشارة الأعشاب الضارة في مكانها.'
          'عند التخطيط للحديقة، ضع في اعتبارك زراعة أنواع من خيار الكروم مثل "Sweet Success" و "Tasty Green" عموديًا على تعريشة أو سياج أو أي دعم آخر. هذا يحقق أفضل استخدام لمساحة الحديقة من خلال احتواء الكروم ومنعها من الانتشار في جميع أنحاء الحديقة، بالإضافة إلى الحفاظ على الثمار نظيفة ومستقيمة أثناء نموها فوق'
          'الأرض. لقد أثبت الباحثون أن زراعة الخيار عموديًا يزيد المحصول بشكل كبير لأن الكروم تتلقى دوران هواء أفضل وأشعة شمس أكثر من الكروم على الأرض.'
    },
    {
      'image': 'assets/images/rayhan.jpg',
      'title': 'ريحان',
      'details': 'شراء الطمي الخشن من متجر الحدائق و البساتين : أو يمكنك اخذ الطمي من حديقة المنزل الخاصة بك و  تتطلب زراعة الريحان تربة خشنة حتي لا تتعفن جذوره .'
          'تحديد قصيص الزرع ( الوعاء ) :  هذا الوعاء يمكن أن يكون مصنوع من الطين و البلاستيك و الحجر أو الأسمنت و يجب أن يوفر صرف صحي كافي للريحان من خلال وجود فتحتات للتصريف في قاع الوعاء .'
          'تعقيم قصيص الزرع جيداً :  و ذلك من خلال نقع القصيص في محلول ماء مكون من الماء و المنظف ثم شطف الوعاء جيداً .'
          'شراء بذور الريحان : عادة ما تكون شتلات الريحان هشة و ضعيفة و يمكن أن تتلف بسهولة أثناء زرع الريحان في التربة .و ذلك تستخدم العديد من الحدائق بذور الريحان .'
          'قم بملء 3/4 من حجم قصيص الزرع بالطمي الخشن بحيث لا تكدس الوعاء بالطمي حتي لا يصعب عليك تثبيت الريحان .'
          'ترطيب التربة : لا يفضل الإفراط في ترطيب التربة  فقط الكمية الكافية من الماء لجعل التربة رطبة قليلاً .'
          'زرع البذور : وضع البذور في التربة بين كل واحدة و الأخري مسافة حوالي  2،5 سم  و خصوصاً إذا كانت القصيص مستديرة '
          'أما في حالة إستخدام قصيص مربعة يمكنك نشر البذور بطريقة عشوائية .'
    },
    {
      'image': 'assets/images/nn.jpeg',
      'title': 'نعناع',
      'details': 'أقطعي عود من النعناع'
          'ضعي التربة في الفخار وأضيفي كمية مناسبة من الماء حتى تصبح التربة رطبة'
          'ضعي نبتة النعناع في التربة'
          'ثم قومي بوضع الفخار في زاوية مشمسة جزئيًا والأفضل أن تكون في المطبخ'
          'حافظي على سقي نبتة النعناع بشكل مستمر وأبعديها عن الأماكن الجافة.'
          'يمكنك زراعة النعناع في زاوية معرضة لأشعة الشمس على أن تسقيها باستمرار.'
          'وعندما تكون تكون السيقان قد أصبحت أطول والأوراق أقصر، يعتبر هذا أفضل وقت لقطف النعناع.'
          'أقطعي الأوراق بنسبة الثلث والنصف من فترة إلى أخرى حتى تنمو الأوراق الجديدة، استخدميها مباشرة أو احتفظي بها في الفريزر.'
    },
    {
      'image': 'assets/images/tt.jpeg',
      'title': 'طماطم',
      'details': 'اختاري نوع البذور المناسب لكِ، هناك نوعان من نبات الطماطم، نوع يصل لطول محدد ثم يبدأ إنتاج الثمار، ونوع آخر ينتج خلال الموسم بكميات قليلة ثم يتوقف في فصل الشتاء، كذلك هناك أنواع مختلفة من البذور لأنواع الطماطم وألوانها، اختاري النوع المفضل لكِ'
          'ازرعي بذور الطماطم في حاوية زرع عمقها 15 سنتيمترًا بها تربة رطبة ولينة، ضعي البذور على عمق ستة ملليمترات من سطح التربة'
          'ضعي الحاوية في مكان دافئ حتى يبدأ الإنبات، يُفضِل البعض وضع الحاوية أعلى الثلاجة'
          'يبدأ النبات الإنبات بعد مدة تتراوح بين خمسة أيام وعشرة أيام'
          'عندما ينبت الزرع، انقلي حاوية الزرع إلى مكان مشمس، تحتاج الطماطم إلى التعرض للشمس يوميًا مدة تتراوح بين ست ساعات وثماني ساعات'
          'يمكنكِ أن تبدئي الزراعة بالشتلات الجاهزة، بدلًا من البداية من مرحلة البذور للتسهيل على نفسك'
          'عندما تبدأ الأزهار الظهور، انقلي النبات إلى وعاء أكبر، وضعيه في مكان درجة حرارته من 24 إلى 29 درجة مئوية، ومعرضًا لضوء الشمس'
          'عند وضع النبات بالقرب من الشباك للتعرض للشمس، اعكسي وضع النبات خلال اليوم، حتى يتعرض النبات من جميع الاتجاهات لضوء الشمس'
          'إذا كان النبات في المنزل ولا يتعرض للرياح، عرضي النبات لهواء المروحة مدة عشر دقائق مرتين يوميًا'
          'اسقي النبات في الأقل مرة أسبوعيًا، وفي المرات شديدة الحرارة مرتين أسبوعيًا أو ثلاث مرات'
          'عندما يصل طول النبات إلى متر، ابدئي إزالة الأوراق من الجزء السفلي من النبات، إذ إن الأوراق في هذا الجزء من النبات معرضة أكثر للإصابة بالأمراض والفطريات، وتستهلك من طاقة النبات وغذائه'
          'لا تزيلي الطماطم إلا بعد نضجها تمامًا'
          'إذا سقطت بعض ثمار الطماطم قبل نضجها، ضعيها في كيس ورقي حتى تنضج'
          'تحتاج الطماطم إلى مدة تتراوح بين أربعين وخمسين يومًا حتى تنضج تمامًا'
    },
    {
      'image': 'assets/images/cucumber.jpg',
      'title': 'خيار',
      'details': 'استخدم نشارة بلاستيكية سوداء أو بنية اللون. نظرًا لأن التربة الدافئة والرطبة ضرورية للإنتاج الأعلى، استخدم نشارة بلاستيكية داكنة على سرير الخيار.'
          'سيؤدي ذلك إلى تسريع النمو وزيادة الغلات من خلال الحفاظ على رطوبة التربة والحفاظ على درجة حرارة عالية للتربة. كما سيبقي النشارة الأعشاب الضارة في مكانها.'
          'عند التخطيط للحديقة، ضع في اعتبارك زراعة أنواع من خيار الكروم مثل "Sweet Success" و "Tasty Green" عموديًا على تعريشة أو سياج أو أي دعم آخر. هذا يحقق أفضل استخدام لمساحة الحديقة من خلال احتواء الكروم ومنعها من الانتشار في جميع أنحاء الحديقة، بالإضافة إلى الحفاظ على الثمار نظيفة ومستقيمة أثناء نموها فوق'
          'الأرض. لقد أثبت الباحثون أن زراعة الخيار عموديًا يزيد المحصول بشكل كبير لأن الكروم تتلقى دوران هواء أفضل وأشعة شمس أكثر من الكروم على الأرض.'
    },
    {
      'image': 'assets/images/rayhan.jpg',
      'title': 'ريحان',
      'details': 'شراء الطمي الخشن من متجر الحدائق و البساتين : أو يمكنك اخذ الطمي من حديقة المنزل الخاصة بك و  تتطلب زراعة الريحان تربة خشنة حتي لا تتعفن جذوره .'
          'تحديد قصيص الزرع ( الوعاء ) :  هذا الوعاء يمكن أن يكون مصنوع من الطين و البلاستيك و الحجر أو الأسمنت و يجب أن يوفر صرف صحي كافي للريحان من خلال وجود فتحتات للتصريف في قاع الوعاء .'
          'تعقيم قصيص الزرع جيداً :  و ذلك من خلال نقع القصيص في محلول ماء مكون من الماء و المنظف ثم شطف الوعاء جيداً .'
          'شراء بذور الريحان : عادة ما تكون شتلات الريحان هشة و ضعيفة و يمكن أن تتلف بسهولة أثناء زرع الريحان في التربة .و ذلك تستخدم العديد من الحدائق بذور الريحان .'
          'قم بملء 3/4 من حجم قصيص الزرع بالطمي الخشن بحيث لا تكدس الوعاء بالطمي حتي لا يصعب عليك تثبيت الريحان .'
          'ترطيب التربة : لا يفضل الإفراط في ترطيب التربة  فقط الكمية الكافية من الماء لجعل التربة رطبة قليلاً .'
          'زرع البذور : وضع البذور في التربة بين كل واحدة و الأخري مسافة حوالي  2،5 سم  و خصوصاً إذا كانت القصيص مستديرة '
          'أما في حالة إستخدام قصيص مربعة يمكنك نشر البذور بطريقة عشوائية .'
    },
  ];
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        backgroundColor: Colors.transparent,
        appBar: AppBar(
          backgroundColor: Colors.green,
          title: Text(plant_details[index]['title'],
              style: TextStyle(fontSize: 20, color: Colors.white)),
        ),
        body: Container(
          height: double.infinity,
          decoration: BoxDecoration(
            image: DecorationImage(
              image: AssetImage(plant_details[index]['image']),
              fit: BoxFit.cover,
            ),
          ),
          padding: EdgeInsets.all(20),
          child: SingleChildScrollView(
            child: Column(
              mainAxisAlignment: MainAxisAlignment.center,
              children: [
                Text(plant_details[index]['details'],
                    style: TextStyle(fontSize: 14, color: Colors.black)),
              ],
            ),
          ),
        ));
  }
}
